In [ ]:
#37. Seleksi baris dengan banyak kriteria

In [1]:
import pandas as pd

In [ ]:
#Persiapan Data Frame
df = pd.read_csv('titanicfull.csv')
df.head()

In [ ]:
#Seleksi baris dengan banyak kriteria
df[(df['sex']=='female') & (df['age']>=60) & (df['embarked']=='S') & (df['survived']==1)]

In [ ]:
df[
    (df['sex']=='female') & 
    (df['age']>=60) & 
    (df['embarked']=='S') & 
    (df['survived']==1)
]

In [ ]:
kr1 = df['sex']=='female'
kr2 = df['age']>=60
kr3 = df['embarked']=='S'
kr4 = df['survived']==1

df[kr1 & kr2 & kr3 & kr4]

In [ ]:
#38. Mengenal parameter header dan skiprows

df = pd.read_csv('iris_error.csv')
df.head(8)

In [ ]:
df = pd.read_csv('iris_error.csv', header=2, skiprows=[5,6])
df.head()

In [ ]:
#39. Mengacak urutan baris pada DataFrame

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Persiapan Data Frame

n_rows = 6
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  4  3  4  3
1  1  3  2  3  1
2  1  2  1  2  4
3  2  1  1  1  1
4  2  4  1  2  1
5  2  3  2  3  4

In [ ]:
# Mengacak urutan baris pada DataFrame

In [4]:

df.sample(frac=1.0, random_state=1)

   A  B  C  D  E
2  1  2  1  2  4
1  1  3  2  3  1
4  2  4  1  2  1
0  2  4  3  4  3
3  2  1  1  1  1
5  2  3  2  3  4

In [5]:
df.sample(frac=1.0, random_state=1).reset_index(drop=True)

   A  B  C  D  E
0  1  2  1  2  4
1  1  3  2  3  1
2  2  4  1  2  1
3  2  4  3  4  3
4  2  1  1  1  1
5  2  3  2  3  4

In [ ]:
#40. Mengakses sekelompok data dengan get_group()

In [ ]:
# Mengakses sekelompok data yang sudah terkelompok dengan get_group()

In [ ]:

grouped_df = df.groupby('sex')

In [ ]:
grouped_df.get_group('female').head(10)

In [ ]:
grouped_df = df.groupby('survived')

In [ ]:

grouped_df.get_group(1).head(10)